cf/InformationRegisters/ПравоПросмотраПосещений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ПравоПросмотраПосещений</Name>
			<Comment>Кто кого просматривает по посещениям если гет ни одной записи в этой таблице тогда просматривать может всех</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Кто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Кого</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/Catalogs/Пользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>Пользователи</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РедактированиеЦеныВДокументе</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Почта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрольВремениПосещений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапретЧужихРазмещений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УстановитьНовыйПарольПриВходе</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьНаСайт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоРозничныйМагазин</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>idДиалогаТелеграм</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПользовательИБ</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КтоМожетПросматриватьСтоимость</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>idстроки</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Идентификатор</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПрофилиИнтернетПочты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Профиль</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПрофильИнтернетПочты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>idстроки</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Идентификатор</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/CommonForms/ИнформацияОПосещенииРабочегоМеста/Ext/Form/Module.bsl
&НаСервере
Функция ОбновитьИнформациюНаСервере()
	
	ВидитВсех = Не Parsec.ПользователюОграниченПросмотр();
	
	// Получим таблицу
	
	ДатаОбновления = ТекущаяДата();
	Таблица = Parsec.ПолучитьТаблицуВходовВыходовЗаДеньПоСотрудникам(День,,ВидитВсех);
	
	Если Таблица <> Неопределено Тогда
		
		Сотрудники.Загрузить(Таблица);
		
		// Добавим кто не пришел
		
		Запрос = Новый Запрос(СтрШаблон("
		|ВЫБРАТЬ РАЗЛИЧНЫЕ 	ФизЛицо 
		|ИЗ 				Справочник.Пользователи
		|ГДЕ 	НЕ ПометкаУдаления И 
		|		КонтрольВремениПосещений И 
		|		ФизЛицо <> ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
		|		%1
		|",
		?(ВидитВсех,"","
		|	И (	ФизЛицо = &текФизЛицо ИЛИ
		|		ФизЛицо В(ВЫБРАТЬ Кого ИЗ РегистрСведений.ПравоПросмотраПосещений ГДЕ Кто = &текПользователь))")));
		
		Запрос.УстановитьПараметр("ПустоеФизЛицо", 		Справочники.ФизическиеЛица.ПустаяСсылка());
		Запрос.УстановитьПараметр("текФизЛицо", 		ПараметрыСеанса.ТекущийПользователь.ФизЛицо);
		Запрос.УстановитьПараметр("текПользователь", 	ПараметрыСеанса.ТекущийПользователь);
		Выборка = Запрос.Выполнить().Выбрать();
		
		ПОка Выборка.Следующий() Цикл Если Не Сотрудники.НайтиСтроки(Новый Структура("ФизЛицо", Выборка.ФизЛицо)).Количество() Тогда Сотрудники.Добавить().ФизЛицо = Выборка.ФизЛицо; КонецЕсли; КонецЦикла;
		
		// Отсортируем

		
		Сотрудники.Сортировать("ФизЛицо");
		
		Возврат Истина;
		
	Иначе
		
		Возврат Ложь КонецЕсли;
		
		
		// Определим текущего
		
			//текСтроки 	= Сотрудники.НайтиСтроки(Новый Структура("ФизЛицо", Сотрудник.ФизЛицо));
			//КолСтрок 	= текСтроки.КОличество(); 
			//НаРаботе	= Ложь;
			//
			//Если КолСтрок И текСтроки[КолСтрок - 1].Вход <> '00010101' И текСтроки[КолСтрок - 1].Вы ход = '00010101' Тогда
			//	НаРаботе = Истина; КонецЕсли;
			//
			//// Настроим красоту
			//
			//Элементы.ДекорацияНаРаботе.Видимость 	= НаРаботе;
			//Элементы.ДекорацияНетНаРаботе.Видимость = Не НаРаботе;
		
КонецФункции
&НаКлиенте
Процедура ОбновитьИнформацию()
	
	// Запомним где стоял курсор
	
	текДанные = Элементы.Сотрудники.ТекущиеДанные;
	Если текДанные <> Неопределено Тогда
		текФизЛицо = текДанные.ФизЛицо; КонецЕсли;

	// Обновим
	
	Если Не ОбновитьИнформациюНаСервере() Тогда
		ПоказатьПредупреждение(,"Ошибка получения данных из внешенй базы Parsec");
	Иначе
	
		// Вернем курсор на место
		
		Если текДанные <> Неопределено Тогда
			
			Строки = Сотрудники.НайтиСтроки(Новый Структура("ФизЛицо", текФизЛицо));
			Если Строки.Количество() Тогда
				
				Элементы.Сотрудники.ТекущаяСтрока = Строки[0].ПолучитьИдентификатор(); КонецЕсли; КонецЕсли; КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Сотрудник 	= ПараметрыСеанса.ТекущийПользователь;
	День		= ТекущаяДата();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Не ОбновитьИнформациюНаСервере() Тогда
		ПоказатьПредупреждение(,"Ошибка получения данных из внешенй базы Parsec");
		Отказ = Истина;
	Иначе
		ПодключитьОбработчикОжидания("ОбновитьИнформацию", 60) КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникПриИзменении(Элемент)
	
	ОбновитьИнформацию();
	
КонецПроцедуры
&НаКлиенте
Процедура ДеньПриИзменении(Элемент)
	
	ОбновитьИнформацию();
	
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	
	ОбновитьИнформацию();
	
КонецПроцедуры

// ОТЧЕТ

&НаСервере
Функция ПолучитьТабличныйДокументПосещенияСотрудника(ФизЛицо)
	
	Возврат Parsec.ПолучитьТабличныйДокументПосещенияСотрудника(ФизЛицо);
	
КонецФункции
&НаКлиенте
Процедура ПоказатьПосещенияНаКлиенте()
	
	текДанные = Элементы.Сотрудники.ТекущиеДанные;
	Если текДанные <> Неопределено Тогда
		
		Таблица = ПолучитьТабличныйДокументПосещенияСотрудника(текДанные.ФизЛицо);
		Таблица.Показать(); КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура ПоказатьПосещения(Команда)
	
	ПоказатьПосещенияНаКлиенте();
	
КонецПроцедуры
&НаКлиенте
Процедура СотрудникиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ПоказатьПосещенияНаКлиенте();
	
КонецПроцедуры
